//---------------------------------------------------------------------------

#include <vcl.h>
#include <iostream>
#pragma hdrstop

//---------------------------------------------------------------------------

#pragma argsused
int main(int argc, char* argv[])
{
   for(int i=1; i<argc; i++)
      std::cout<<*(argv+i)<<std::endl;
   std::cout<<"éöóêåíãøùçõú"<<std::endl<<"ôûâàïðîëäæý"<<std::endl<<"ÿ÷ñìèòüáþ"<<std::endl;
   return 0;
}
//---------------------------------------------------------------------------
 